# tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap '1password/tap'
tap 'jesseduffield/lazygit'
tap 'norwoodj/tap'
tap 'ngrok/ngrok'
tap 'siderolabs/tap'
tap 'fairwindsops/tap'
tap 'fluxcd/tap'

# Binaries
brew 'chezmoi'
brew 'mas'
brew 'bash' # Latest Bash version
brew 'zsh'
brew 'zoxide'
brew 'spaceship'
brew 'grep'
brew 'coreutils' # Those that come with macOS are outdated
brew 'pkg-config'
brew 'ack'
brew 'wget'
brew 'httpie'
brew 'ncdu'
brew 'hub'
brew 'tldr'
brew 'bind' # used to have dig as binary
brew 'nmap'
brew 'fzf'
brew 'fd'
brew 'bat'
brew 'fx'
brew 'eza'
brew 'fswatch'
brew 'ghostscript'
brew 'zsh-autosuggestions'
brew 'prettyping'
brew 'ettercap'
brew 'ffmpeg'
brew 'gpg'
brew 'ocrmypdf'
brew 'tesseract-lang'
brew 'svn' # Needed to install fonts
brew 'mas' # Mac App Store manager
brew 'libpq' # PostgresQL client
brew 'jq' # JSON parser
brew 'git'
brew 'git-delta' # Git diff viewer
brew 'lazygit'
brew 'pre-commit' # Git hooks
brew 'gh' # GitHub CLI
brew 'sops'
brew 'age'
brew 'ngrok'
brew 'mat2'
brew 'pnpm'
brew 'make'
brew 'aerc'
brew 'w3m'
brew 'dante'
brew 'thefuck'
brew 'gource'
brew 'awscli'
brew 'tree'
# brew 'mysql-client' # when using Laravel Herd, use the binaries from this tool! You may have to Symlink the binaries from the Services tab.
brew 'ansible'
brew 'yq'
brew 'watch'
brew 'packer'

# Kubernetes
brew 'kubernetes-cli' # kubectl and dependencie for other plugins
brew 'talosctl'
brew 'helm'
brew 'helm-docs'
brew 'velero'
brew 'argocd'
brew 'cilium-cli'
brew 'istioctl'
brew 'kubectx'
brew 'kubent' # check your clusters for use of deprecated APIs
brew 'kustomize'
brew 'restic'
brew 'fairwindsops/tap/nova'
brew 'fluxcd/tap/flux'
brew 'dive'
brew 'bruno'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# PHP Dependencies
# brew 'php'
# brew 'php@8.2'
# brew 'php@8.1'
# brew 'php@8.0'
# brew 'php@7.4'
# brew 'composer'
# brew 'libyaml'
# brew 'imagemagick'

# Valet
# brew 'dnsmasq'
# brew 'mysql', restart_service: true
# brew 'nginx'
# brew 'redis', restart_service: true

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-open-sans'
cask 'font-roboto'

 # Apps
cask 'raycast'
cask 'appcleaner'
cask 'setapp'
cask 'discord'
cask 'docker'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'notion'
cask 'sonos'
cask 'zoom'
cask 'spotify'
cask 'thunderbird'
cask 'raindropio'
brew 'visual-studio-code'
brew 'cursor'
cask 'tinkerwell'
cask '1password-cli'
cask 'mackup'
cask 'sensiblesidebuttons'
# cask 'ray'
# cask 'helo'

# Quicklook
cask 'syntax-highlight'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'suspicious-package'
cask 'webpquicklook'
cask 'qlimagesize'
